Repository: vcaldas/python-guide
Catalog: docs/locale/*/LC_MESSAGES/dev/pip-virtualenv.po
Languages: pt_br

source: Further Configuration of Pip and Virtualenv
pt_br: Configuração avançada do Pip e Virtualenv

source: Requiring an active virtual environment for ``pip``
pt_br: Requisitando um ambiente virtual ativo para o "pip"

source: By now it should be clear that using virtual environments is a great way to keep your development environment clean and keeping different projects' requirements separate.
pt_br: Agora deve estar claro que usar ambientes virtuais é um ótimo meio para deixar seu ambiente virtual limpo e manter necessidades de diferentes projetos separadas.

source: When you start working on many different projects, it can be hard to remember to activate the related virtual environment when you come back to a specific project. As a result of this, it is very easy to install packages globally while thinking that you are actually installing the package for the virtual environment of the project. Over time this can result in a messy global package list.
pt_br: Quando você começa a trabalhar em muitos projetos diferentes, pode ser difícil lembrar-se de ativar o ambiente virtual certo quando você volta para um projeto específico. Como resultado disso, é muito fácil instalar pacotes globalmente enquanto acha que está instalando apenas o pacote do ambiente virtual do projeto. Com o tempo isso pode ocasionar uma bagunça na sua lista de pacotes globais.

source: In order to make sure that you install packages to your active virtual environment when you use ``pip install``, consider adding the following line to your :file:`~/.bashrc` file:
pt_br: Para ter certeza que você está instalando pacotes em seu ambiente virtual ao usar "pip install", adicione a seguinte linha ao seu :file:`~/.bashrc` file:

source: After saving this change and sourcing the :file:`~/.bashrc` file with ``source ~/.bashrc``, pip will no longer let you install packages if you are not in a virtual environment. If you try to use ``pip install`` outside of a virtual environment pip will gently remind you that an activated virtual environment is needed to install packages.
pt_br: Após salvar essas mudanças e **sourcing** o arquivo :file:`~/.bashrc` com ``source ~/.bashrc``, o pip não vai mais deixar você instalar pacotes se você não estiver em um ambiente virtual. Se você tentar usar ``pip install`` fora de um ambiente virtual, o pip vai lhe lembrar que um ambiente virtual ativado é necessário para a instalação de pacotes.

source: You can also do this configuration by editing your :file:`pip.conf` or :file:`pip.ini` file. :file:`pip.conf` is used by Unix and Mac OS X operating systems and it can be found at:
pt_br: Você também pode fazer essa modificação ao editar o seus arquivos :file:`pip.conf` ou :file:`pip.ini`. :file:`pip.conf` é usado pelos sistemas operacionais Unix e MAC OS X e pode ser achado em:

source: Similarly, the :file:`pip.ini` file is used by Windows operating systems and it can be found at:
pt_br: Do mesmo modo, o arquivo :file:`pip.ini` é utilizado pelos sistemas operacionais Windows e pode ser encontrado em:

source: If you don't have a :file:`pip.conf` or :file:`pip.ini` file at these locations, you can create a new file with the correct name for your operating system.
pt_br: Se você não possuir um arquivo :file:`pip.conf` ou :file:`pip.ini` nesses locais, você pode criar um novo arquivo com os nomes corretos do seu sistema operacional.

source: If you already have a configuration file, just add the following line under the ``[global]`` settings to require an active virtual environment:
pt_br: Caso você já tenha um arquivo de configuração, basta adicionar as seguintes linhas abaixo das configurações ``[globais]`` para requerir um ambiente virtual ativo.

source: If you did not have a configuration file, you will need to create a new one and add the following lines to this new file:
pt_br: Se você não tinha um arquivo de configuração, você terá que criar um novo e adicionar as seguintes linhas ao mesmo:

source: You will of course need to install some packages globally (usually ones that you use across different projects consistently) and this can be accomplished by adding the following to your :file:`~/.bashrc` file:
pt_br: Você obviamente precisará instalar alguns pacotes globalmente (geralmente os que você usa em pacotes diferentes com frequência), e isso pode ser feito ao adicionar a seguinte linha ao seu arquivo :file:`~/.bashrc`.

source: After saving the changes and sourcing your :file:`~/.bashrc` file you can now install packages globally by running ``gpip install``. You can change the name of the function to anything you like, just keep in mind that you will have to use that name when trying to install packages globally with pip.
pt_br: Depois de salvar as alterações e o seu arquivo arquivo fonte :file:`~/.bashrc` agora você pode instalar pacotes globalmente executando ``gpip install``. Você pode alterar o nome da função para qualquer coisa que você gosta, basta ter em mente que terás que usar esse nome ao tentar instalar pacotes globalmente com o ``pip``.

source: Caching packages for future use
pt_br: Pacotes de cache para uso futuro

source: Every developer has preferred libraries and when you are working on a lot of different projects, you are bound to have some overlap between the libraries that you use. For example, you may be using the ``requests`` library in a lot of different projects.
pt_br: Cada desenvolvedor tem bibliotecas preferenciais e quando você está trabalhando em um monte de projetos diferentes, és obrigado a ter alguma sobreposição entre as bibliotecas que você usa. Por exemplo, você pode estar usando a biblioteca ``requests`` em vários projetos diferentes.

source: It is surely unnecessary to re-download the same packages/libraries each time you start working on a new project (and in a new virtual environment as a result). Fortunately, you can configure pip in such a way that it tries to reuse already installed packages.
pt_br: É certamente desnecessário refazer o download dos mesmos pacotes/bibliotecas toda vez que começarmos a trabalhar em um novo projeto (e em um novo ambiente virtual como resultado). Felizmente, podemos configurar o pip de tal forma que ele saiba reutilizar pacotes já instalados.

source: On UNIX systems, you can add the following line to your :file:`.bashrc` or :file:`.bash_profile` file.
pt_br: Em sistemas UNIX, você pode adicionar a seguinte linha ao seu arquivo :file:`.bashrc` ou :file:`.bash_profile`.

source: You can set the path to anywhere you like (as long as you have write access). After adding this line, ``source`` your :file:`.bashrc` (or :file:`.bash_profile`) file and you will be all set.
pt_br: Você pode definir o caminho para qualquer lugar que gostes (contanto que você tenha acesso de gravação). Depois de adicionar esta linha, os seus ``source`` :file:`.bashrc` (ou :file:`.bash_profile`) estarão todos definido.

source: Another way of doing the same configuration is via the :file:`pip.conf` or :file:`pip.ini` files, depending on your system. If you are on Windows, you can add the following line to your :file:`pip.ini` file under ``[global]`` settings:
pt_br: Outra maneira de fazer a mesma configuração é através dos arquivos :file:`pip.conf` ou :file:`pip.ini`, dependendo do seu sistema. Se estivermos no Windows, podemos adicionar a seguinte linha ao nosso arquivo :file:`pip.ini` em ``[global]`` settings:

source: Similarly, on UNIX systems you should simply add the following line to your :file:`pip.conf` file under ``[global]`` settings:
pt_br: Da mesma forma, em sistemas UNIX, simplesmente devemos adicionar a seguinte linha ao nosso arquivo :file:`pip.conf` em ``[global]`` settings:

source: Even though you can use any path you like to store your cache, it is recommended that you create a new folder *in* the folder where your :file:`pip.conf` or :file:`pip.ini` file lives. If you don't trust yourself with all of this path voodoo, just use the values provided here and you will be fine.
pt_br: Mesmo que você possa usar qualquer caminho que você gosta de armazenar o seu cache, recomenda-se que você crie uma nova pasta *dentro de* onde o arquivo :file:`pip.conf` ou o :file:`pip.ini` reside. Se você não confiares em si próprio mesmo com todo esse caminho voodoo, basta usar os valores fornecidos aqui e estarás bem.
