Repository: vcaldas/python-guide
Catalog: docs/locale/*/LC_MESSAGES/starting/install/linux.po
Languages: pt_br

source: To see which version of Python you have installed, open a command prompt and run
pt_br: Para ver qual versão do Python você instalou, abra um prompt de comando e execute

source: You do not need to install or configure anything else to use Python. Having said that, I would strongly recommend that you install the tools and libraries described in the next section before you start building Python applications for real-world use. In particular, you should always install Setuptools and pip, as it makes it much easier for you to use other third-party Python libraries.
pt_br: Você não precisa instalar ou configurar qualquer outra coisa para usar o Python. Tendo dito isso, eu recomendo fortemente que você instale as ferramentas e bibliotecas descritas na próxima seção antes de começar a construir aplicativos Python para uso no mundo real. Em particular, você deve sempre instalar o Setuptools e o pip, já que isso facilita muito o uso de outras bibliotecas Python de terceiros.

source: The two most crucial third-party Python packages are `setuptools <https://pypi.python.org/pypi/setuptools>`_ and `pip <https://pip.pypa.io/en/stable/>`_.
pt_br: Os dois pacotes de Python de terceiros mais cruciais são `setuptools <https://pypi.python.org/pypi/setuptools>`_ e `pip <https://pip.pypa.io/en/stable/>`_.

source: Once installed, you can download, install and uninstall any compliant Python software product with a single command. It also enables you to add this network installation capability to your own Python software with very little work.
pt_br: Uma vez instalado, você pode baixar, instalar e desinstalar qualquer produto de software Python compatível com um único comando. Ele também permite que você adicione esse recurso de instalação de rede ao seu próprio software Python com muito pouco trabalho.

source: Python 2.7.9 and later (on the python2 series), and Python 3.4 and later include pip by default.
pt_br: O Python 2.7.9 e posterior (na série python2) e o Python 3.4 e posterior incluem pip por padrão.

source: To see if pip is installed, open a command prompt and run
pt_br: Para ver se o pip está instalado, abra um prompt de comando e execute

source: To install pip, `follow the official pip installation guide <https://pip.pypa.io/en/latest/installing/>`_ - this will automatically install the latest version of setuptools.
pt_br: Para instalar o pip, `siga o guia oficial de instalação do pip <https://pip.pypa.io/en/latest/installing/>`_ - isso instalará automaticamente a versão mais recente do setuptools.

source: Virtual Environments
pt_br: Ambientes virtuais

source: A Virtual Environment is a tool to keep the dependencies required by different projects in separate places, by creating virtual Python environments for them. It solves the "Project X depends on version 1.x but, Project Y needs 4.x" dilemma, and keeps your global site-packages directory clean and manageable.
pt_br: Um Virtual Environment (Ambiente virtual) é uma ferramenta que permite guardar as dependências de projetos diferentes em lugares separados criando um ambiente virtual Python para cada um deles. Isso resolve problemas como "O projeto X usa uma biblioteca na versão 1.x mas o projeto Y usa essa mesma biblioteca mas na versão 4.x" e mantém os seus pacotes instalados na pasta site-packages global limpa e organizada.

source: For example, you can work on a project which requires Django 1.10 while also maintaining a project which requires Django 1.8.
pt_br: Por exemplo, você pode trabalhar em um projeto que usa o Django na versão 1.10 enquanto também poderá trabalhar em um outro projeto que use o Django mas na versão 1.8.

source: To start using this and see more information: :ref:`Virtual Environments <virtualenvironments-ref>` docs.
pt_br: Para começar a usar isso e ver mais informações: documentação :ref:`Ambientes Virtuais <virtualenvironments-ref>`.

source: You can also use :ref:`virtualenvwrapper <virtualenvwrapper-ref>` to make it easier to manage your virtual environments.
pt_br: Você também pode usar :ref:`virtualenvwrapper <virtualenvwrapper-ref>` para facilitar o gerenciamento de seus ambientes virtuais.

source: This page is a remixed version of `another guide <http://www.stuartellis.eu/articles/python-development-windows/>`_, which is available under the same license.
pt_br: Esta página é uma versão remixada de `outro guia <http://www.stuartellis.eu/articles/python-development-windows/>`_, que está disponível sob a mesma licença.
