Repository: vcaldas/python-guide
Catalog: docs/locale/*/LC_MESSAGES/intro/community.po
Languages: pt_br

source: The Community
pt_br: A comunidade

source: Guido van Rossum, the creator of Python, is often referred to as the BDFL — the Benevolent Dictator For Life.
pt_br: Guido van Rossum, o criador do Python, é apelidado de "BDFL" - "the Benevolent Dictator for Life"* *NT: "O ditador benevolente vitalício"

source: Python Software Foundation
pt_br: Fundação de Software de Python

source: The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers.
pt_br: A missão da Fundação de Software de Python é promover, proteger e avançar a linguagem de programação Python, e ajudar e facilitar o crescimento de uma comunidade diversificada e internacional de programadores Python.

source: `Learn More about the PSF <http://www.python.org/psf/>`_.
pt_br: Aprenda mais sobre a PSF <http://www.python.org/psf/>

source: PEPs are *Python Enhancement Proposals*. They describe changes to Python itself, or the standards around it.
pt_br: PEPs são "Propostas de Enriquecimento do Python". Elas descrevem mudanças ao próprio Python, ou às normas do mesmo.

source: There are three different types of PEPs (as defined by :pep:`1`):
pt_br: Existem três diferentes tipos de PEPs (como definido pelo :pep:`1`):

source: **Standards**
pt_br: "Normas"

source: Describes a new feature or implementation.
pt_br: Descreve um novo recurso ou implementação.

source: **Informational**
pt_br: "informacional"

source: Describes a design issue, general guidelines, or information to the community.
pt_br: Descreve um problema de design, diretrizes gerais ou informação à comunidade.

source: **Process**
pt_br: "Processo"

source: Describes a process related to Python.
pt_br: Descreve um processo relacionado ao Python.

source: Notable PEPs
pt_br: PEPs notáveis

source: There are a few PEPs that could be considered required reading:
pt_br: Existem algumas PEPs que podem ser consideradas como leitura obrigatória:

source: :pep:`8`: The Python Style Guide.
pt_br: :pep:`8`: O Guia de Estilo do Python

source: Read this. All of it. Follow it.
pt_br: Leia o guia. Todo ele. Siga ele.

source: :pep:`20`: The Zen of Python.
pt_br: :pep:`20`: O Zen do Python

source: A list of 19 statements that briefly explain the philosophy behind Python.
pt_br: Uma lista de 19 enunciados que explicam brevemente a filosofia por trás do Python.

source: :pep:`257`: Docstring Conventions.
pt_br: :pep:`257`: Convenções de **Docstring**

source: Gives guidelines for semantics and conventions associated with Python docstrings.
pt_br: Dá diretrizes para semântica e convenções associadas com **docstrings** do Python.

source: You can read more at `The PEP Index <http://www.python.org/dev/peps/>`_.
pt_br: Você pode ler mais no `The PEP Index* <http://www.python.org/dev/peps/>`_. *NT: "O índice de PEPs"

source: Submitting a PEP
pt_br: Enviando uma PEP

source: PEPs are peer-reviewed and accepted/rejected after much discussion. Anyone can write and submit a PEP for review.
pt_br: PEPs são avaliadas pelo público e aceitas/rejeitas depois de muita discussão. Qualquer um pode escrever e enviar uma PEP para avaliação.

source: Here's an overview of the PEP acceptance workflow:
pt_br: Aqui está uma visão geral do fluxo de aceitação de uma PEP:

source: Python Conferences
pt_br: Conferências de Python

source: The major events for the Python community are developer conferences. The two most notable conferences are PyCon, which is held in the US, and its European sibling, EuroPython.
pt_br: Os principais eventos para a comunidade Python são as conferências de desenvolvedores. As duas conferências mais notáveis são a PyCon, que acontece nos Estados Unidos, e sua parente européia, a EuroPython.

source: A comprehensive list of conferences is maintained at `pycon.org <http://www.pycon.org/>`_.
pt_br: Uma lista completa de conferências é mantida em `pycon.org <http://www.pycon.org/>`_.

source: Python User Groups
pt_br: Grupos de Usuários de Python

source: User Groups are where a bunch of Python developers meet to present or talk about Python topics of interest. A list of local user groups is maintained at the `Python Software Foundation Wiki <http://wiki.python.org/moin/LocalUserGroups>`_.
pt_br: Grupos de usuários são onde um monte de desenvolvedores Python se encontram para apresentar ou conversar sobre tópicos de interesses relacionados ao Python. Uma lista de grupos de usuários locais é mantida na `Python Software Foundation Wiki*<http://wiki.python.org/moin/LocalUserGroups>`_. *NT: "Wikipédia da Fundação de Software de Python"
