Repository: vcaldas/python-guide
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: The Hitchhiker's Guide to Python!
pt_br: O Guia do Mochileiro para Python!

source: Greetings, Earthling! Welcome to The Hitchhiker's Guide to Python.
pt_br: Saudações, Terráqueos! Bem-vindos ao Guia do Mochileiro para Python!

source: This handcrafted guide exists to provide both novice and expert Python developers a best practice handbook to the installation, configuration, and usage of Python on a daily basis.
pt_br: Esse guia feito à mão existe para prover um manual de boas maneiras sobre instalação, configuração e uso de Python no dia-a-dia para novos e experientes usuários.

source: This guide is **opinionated** in a way that is almost, but not quite, entirely *unlike* Python's official documentation. You won't find a list of every Python web framework available here. Rather, you'll find a nice concise list of highly recommended options.
pt_br: Esse guia é realizado de uma forma que é quase, mas não 100%, totalmente diferente da documentação oficial do Python. Você não vai achar uma lista de todos os frameworks web disponíveis para Python aqui: você achará uma lista concisa de opções altamente recomendadas.

source: Let's get started! But first, let's make sure you know where your towel is.
pt_br: Vamos começar! Mas primeiro vamos ter certeza de que você sabe onde está sua toalha.

source: Getting Started with Python
pt_br: Começando com Python

source: Python Development Environments
pt_br: Ambientes de desenvolvimento em Python

source: Writing Great Python Code
pt_br: Escrevendo Ótimos códigos em Python

source: This part of the guide focuses on the best-practices for writing Python code.
pt_br: Essa parte do guia foca-se nas melhores praticas para escrita de códigos em Python.

source: Scenario Guide for Python Applications
pt_br: Guia de cenário para aplicações em Pyhton

source: This part of the guide focuses on tool and module advice based on different scenarios.
pt_br: Essa parte do guia foca-se em dicas de ferramentas e módulos baseados em diferentes cenários.

source: Shipping Great Python Code
pt_br: Entregando um ótimo código em Python

source: This part of the guide focuses on deploying your Python code.
pt_br: Essa parte do guia foca-se em rodar o seu código em Python.

source: Additional Notes
pt_br: Notas adicionais

source: Notes defined within all diatonic and chromatic musical scales have been intentionally excluded from this list of additional notes. Additionally, this note.
pt_br: Todas as notas definidas nas escalas musicais diatônicas e cromáticas foram intencionalmente excluidas dessa lista de notas adicionais.

source: Contribution notes and legal information (for those interested).
pt_br: Notas de contribuição e informações legais (aos interessados)
